<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class TaskSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::unprepared("INSERT INTO `tasks` (`id`, `name`, `note`, `status`, `date`, `time`, `user_id`, `create_by_id`, `created_at`, `updated_at`) VALUES
(1, 'صرف ناهار', 'صرف ناهار با دوستان', 'doing', '2022-08-04', '12:05:30', 2, 1, '2022-08-04 10:05:21', '2022-08-04 10:32:04'),
(2, 'صرف ناهار', 'صرف ناهار با دوستان', 'planned', '2022-08-04', '12:20:30', 1, 1, '2022-08-04 10:09:45', '2022-08-06 09:21:34'),
(3, 'صرف ناهار', 'صرف ناهار با دوستان', 'success', '2022-08-04', '12:20:30', 3, 1, '2022-08-04 10:09:51', '2022-08-04 11:18:07'),
(6, 'صرف ناهار', 'صرف ناهار با دوستان', 'planned', '2022-08-04', '12:20:30', 3, 1, '2022-08-04 10:53:39', '2022-08-04 10:53:39'),
(7, 'صرف ناهار', 'صرف ناهار با دوستان', 'retarded', '2022-08-05', '12:20:30', 1, 1, '2022-08-04 10:09:45', '2022-08-04 11:17:36'),
(8, 'انجام پروژه 1', 'پروژه لاراول', 'delete', '2022-08-06', '12:20:30', 1, 1, '2022-08-06 08:16:08', '2022-08-06 09:22:10'),
(9, 'انجام پروژه 2', 'پروژه لاراول', 'delete', '2022-08-05', '12:20:30', 1, 1, '2022-08-06 08:16:12', '2022-08-06 08:16:12'),
(10, 'انجام پروژه 3', '\nپروژه لاراول\n\nنمونه پروه ؟؟', 'success', '2022-08-07', '16:20:30', 1, 1, '2022-08-06 08:16:18', '2022-08-06 09:22:19'),
(11, 'انجام پروژه 2', 'پروژه لاراول', 'delete', '2022-08-05', '12:20:30', 2, 1, '2022-08-06 08:16:12', '2022-08-06 08:16:12'),
(12, 'وظیفه 1', 'نمونه\nخوبی ؟؟', 'planned', '2022-08-09', '15:37:39', 1, 1, '2022-08-09 08:05:18', '2022-08-09 08:05:18'),
(13, 'وظیفه 1', 'نمونه\nخوبی ؟؟', 'delete', '2022-08-09', '15:37:39', 1, 1, '2022-08-09 08:05:26', '2022-08-09 08:28:58'),
(14, 'وظیفه 2', 'نمونه\n\n123', 'retarded', '2022-08-08', '12:36:31', 2, 1, '2022-08-09 08:06:54', '2022-08-09 08:46:39'),
(15, '1233', '233', 'retarded', '2022-08-11', '12:39:04', 3, 1, '2022-08-09 08:10:40', '2022-08-09 08:10:40'),
(16, '2566', '84\n566', 'cancel', '2022-08-10', '12:58:59', 3, 1, '2022-08-09 08:29:24', '2022-08-09 08:29:24'),
(17, 'صرف', 'صرف با', 'planned', '2022-08-04', '12:20:30', 2, 1, '2022-08-09 13:48:14', '2022-08-09 13:48:14');");
    }
}
